// Для каждого описанного ниже выражения описать, чему будет равен результат выражения
// Описать почему так в комментарии к выражению

("1" + 1) === ...;
("1" - 1) === ...;

(1 + true) === ...;
(true + false) === ...;

({} + {}) === ...;

({} === {}) === ...;
(Object === Object) === ...;

((() => {}) + 100) === ...;

("b" + "a" + + "a" + "a") === ...;

(([] + []) === []) === ...;
(![1]) === ...;

(!"") === ...;
(!"     ") === ...;

(undefined === 0) === ...;

(null === null) === ...;
(null == null) === ...;
(null >= null) === ...;

(Math.max() > Math.min()) === ...;